// 시간의 순서에 따라서 공연 진행 -> 프로그램
// 시간의 순서에 따른 진행 -> 프로그램

// 각각의 작업들 하나하나로는 그다지 의미가 없지만, 시간의 순서에 따라서 실행되게 할 수 있다면
// 자동화를 할 수 있게 됨
// 자동화된 처리

// 자동화하는 방법


public class program{
    public static void main(String[] args ){
        System.out.println(1);
        System.out.println(2);
        System.out.println(3);
        // 이 세줄이 1억줄이고, 사소하지 않으며 너무너무 중요한 코드
        // 하루에도 수십번씩 실행되고
        // 엄청나게 많은 사람이 쓴다면?
        // 하나하나의 기능
        // 읽는다 쓴다
        // 우리가 하고자하는 일에 맞게 배치를 하면
        // 각각의 작업들이 언제 끝날지 예측할 수 없는 작업이라면?
        // 만약 1년후에 끝나는 작업이라면?
        // 프로그래밍 -> 순차적 실앵을 기계에게 위임해서 자동화할 수 있다.
    }
}


// 프로그램을 만들었음 자바로 -> 엘리베이터를 호출 할 수 있음
// 시큐리티 해제 및 집에서

// 동작시키는 도구

//하고자 하는 일을 시간의 흐름에 따라 ~

// 애플리케이션 만들어보자

// 지름길

// 프로그램을 만들때 혼자 만들지 않음
// 남이 만든 부품을 결합해서 완제품을 만들 것

// egoing github java-iot를 참고할 것



